tutorials/untested/massStefTubeVSM/system/integrace
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      integrace;
}

integrace
{
    type surfaceFieldValue;
    libs ("libfieldFunctionObjects.so");
    enabled yes;
    log yes;
    writeFields no;
    regionType faceZone;
    name batt1;
    operation areaAverage;
    // operation weightedAverage;
    // weightField phi;
    fields
    (
        cCOS
        gradCCO
        yCOS
        gradYCO
    );
}